# Implicit Conversion (CloudPoint to XYZ) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CloudPoint ImplicitWideningImplicitImplicitImplicit Conversion (CloudPoint to XYZ)
CloudPoint Structure See Also
---
Creates an XYZ object from this point cloud.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static implicit operator XYZ (
	CloudPoint cp
)
```

Visual Basic
---
```text
Public Shared Widening Operator CType ( _
	cp As CloudPoint _
) As XYZ
```

Visual C++
---
```text
static implicit operator XYZ^ (
	CloudPoint cp
)
```

# ### Parameters
cp
    Type: Autodesk.Revit.DB.PointClouds..::..CloudPoint
# See Also
CloudPoint Structure
Autodesk.Revit.DB.PointClouds Namespace